openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Mcu.c
}

//-------------------------------------------------------------------

Mcu_PllStatusType Mcu_GetPllStatus(void)
{
    VALIDATE_W_RV( ( 1 == Mcu_Global.initRun ), MCU_GETPLLSTATUS_SERVICE_ID, MCU_E_UNINIT, MCU_PLL_STATUS_UNDEFINED );
    Mcu_PllStatusType rv;

    if( !SIMULATOR() )
    {
#if defined(CFG_MPC560XB)
    	if ( !CGM.FMPLL_CR.B.S_LOCK )
    	{
    		rv = MCU_PLL_UNLOCKED;
    	} else
    	{
    		rv = MCU_PLL_LOCKED;
    	}
#elif defined(CFG_MPC5606S) || defined(CFG_MPC5604P)
    	if ( !CGM.FMPLL[0].CR.B.S_LOCK )
    	{
    		rv = MCU_PLL_UNLOCKED;
    	} else
    	{
    		rv = MCU_PLL_LOCKED;
    	}
#else
    	if ( !FMPLL.SYNSR.B.LOCK )
    	{
    		rv = MCU_PLL_UNLOCKED;
    	} else
    	{
    		rv = MCU_PLL_LOCKED;
    	}
#endif
    }
    else
    {
    	/* We are running on instruction set simulator. PLL is then always in sync... */
    	rv = MCU_PLL_LOCKED;
    }

  return rv;
}

//-------------------------------------------------------------------

Mcu_ResetType Mcu_GetResetReason(void)
{
	Mcu_ResetType rv;

	VALIDATE_W_RV( ( 1 == Mcu_Global.initRun ), MCU_GETRESETREASON_SERVICE_ID, MCU_E_UNINIT, MCU_RESET_UNDEFINED );

#if defined(CFG_MPC560X)
	if( RGM.FES.B.F_SOFT ) {
		rv = MCU_SW_RESET;
	} else if( RGM.DES.B.F_SWT ) {
		rv = MCU_WATCHDOG_RESET;
	} else if( RGM.DES.B.F_POR ) {
		rv = MCU_POWER_ON_RESET;
	} else {
		rv = MCU_RESET_UNDEFINED;
	}
#else
	if( SIU.RSR.B.SSRS ) {
		rv = MCU_SW_RESET;
	} else if( SIU.RSR.B.WDRS ) {
		rv = MCU_WATCHDOG_RESET;
	} else if( SIU.RSR.B.PORS || SIU.RSR.B.ERS ) {
		rv = MCU_POWER_ON_RESET;
	} else {
		rv = MCU_RESET_UNDEFINED;
	}
#endif

	return rv;
}

//-------------------------------------------------------------------

Mcu_RawResetType Mcu_GetResetRawValue(void)
{
	VALIDATE_W_RV( ( 1 == Mcu_Global.initRun ), MCU_GETRESETREASON_SERVICE_ID, MCU_E_UNINIT, MCU_GETRESETRAWVALUE_UNINIT_RV );

	if( !Mcu_Global.initRun ) {
		return MCU_GETRESETRAWVALUE_UNINIT_RV;
	}

#if defined(CFG_MPC560X)
	if( RGM.DES.R )
		return RGM.DES.R;
	else
		return RGM.FES.R;
#else
	return SIU.RSR.R;
#endif

}

//-------------------------------------------------------------------

#if ( MCU_PERFORM_RESET_API == STD_ON )
void Mcu_PerformReset(void)
{
	VALIDATE( ( 1 == Mcu_Global.initRun ), MCU_PERFORMRESET_SERVICE_ID, MCU_E_UNINIT );

	// Reset
#if defined(CFG_MPC560X)
    ME.MCTL.R = 0x00005AF0;
    ME.MCTL.R = 0x0000A50F;

    while (ME.GS.B.S_MTRANS) {}
    while(ME.GS.B.S_CURRENTMODE != 0) {}
#else
	SIU.SRCR.B.SSR = 1;
#endif

}
#endif

//-------------------------------------------------------------------

void Mcu_SetMode( Mcu_ModeType mcuMode)
{
	VALIDATE( ( 1 == Mcu_Global.initRun ), MCU_SETMODE_SERVICE_ID, MCU_E_UNINIT );
	// VALIDATE( ( McuMode <= Mcu_Global.config->McuNumberOfMcuModes ), MCU_SETMODE_SERVICE_ID, MCU_E_PARAM_MODE );

	Mcu_Arc_SetModePre();
	Mcu_Arc_PostSetModePost();
}

//-------------------------------------------------------------------

/**
 * Get the system clock in Hz. It calculates the clock from the
 * different register settings in HW.
 */
uint32_t McuE_GetSystemClock(void)
{
	/*
	 * System clock calculation
	 *
	 * 5516 -  f_sys = extal * (emfd+16) / ( (eprediv+1) * ( erfd+1 ));
	 * 5567 -  f_sys = extal * (emfd+4) / ( (eprediv+1) * ( 2^erfd ));
	 * 563x -  We run in legacy mode = 5567
	 * 5606s - f_sys = extal * emfd / ((eprediv+1)*(2<<(erfd)));
	 */
#if defined(CFG_MPC5516) || defined(CFG_MPC5668)
	uint32_t eprediv = FMPLL.ESYNCR1.B.EPREDIV;
	uint32_t emfd = FMPLL.ESYNCR1.B.EMFD;
	uint32_t erfd = FMPLL.ESYNCR2.B.ERFD;
#elif defined(CFG_MPC5554) || defined(CFG_MPC5567) || defined(CFG_MPC5633)
	uint32_t eprediv = FMPLL.SYNCR.B.PREDIV;
	uint32_t emfd = FMPLL.SYNCR.B.MFD;
	uint32_t erfd = FMPLL.SYNCR.B.RFD;
#elif defined(CFG_MPC560XB)
    uint32_t eprediv = CGM.FMPLL_CR.B.IDF;
    uint32_t emfd = CGM.FMPLL_CR.B.NDIV;
    uint32_t erfd = CGM.FMPLL_CR.B.ODF;
#elif defined(CFG_MPC5606S) || defined(CFG_MPC5604P)
    uint32_t eprediv = CGM.FMPLL[0].CR.B.IDF;
    uint32_t emfd = CGM.FMPLL[0].CR.B.NDIV;
    uint32_t erfd = CGM.FMPLL[0].CR.B.ODF;
#endif

    uint32_t f_sys;
    uint32  extal = Mcu_Global.config->McuClockSettingConfig[Mcu_Global.clockSetting].McuClockReferencePointFrequency;

    f_sys = CALC_SYSTEM_CLOCK(extal,emfd,eprediv,erfd);

    return f_sys;
}

#if defined(CFG_MPC5668)
uint32_t McuE_GetPeripheralClock(McuE_PeriperalClock_t type) {
	uint32_t sysClock = McuE_GetSystemClock();
	vuint32_t prescaler;

	switch (type)
	{
		case PERIPHERAL_CLOCK_FLEXCAN_A:
		case PERIPHERAL_CLOCK_FLEXCAN_B:
		case PERIPHERAL_CLOCK_FLEXCAN_C:
		case PERIPHERAL_CLOCK_FLEXCAN_D:
		case PERIPHERAL_CLOCK_FLEXCAN_E:
		case PERIPHERAL_CLOCK_FLEXCAN_F:
		case PERIPHERAL_CLOCK_DSPI_A:
		case PERIPHERAL_CLOCK_DSPI_B:
		case PERIPHERAL_CLOCK_DSPI_C:
		case PERIPHERAL_CLOCK_DSPI_D:
			prescaler = SIU.SYSCLK.B.LPCLKDIV1;
			break;
		case PERIPHERAL_CLOCK_ESCI_A:
		case PERIPHERAL_CLOCK_ESCI_B:
		case PERIPHERAL_CLOCK_ESCI_C:
		case PERIPHERAL_CLOCK_ESCI_D:
		case PERIPHERAL_CLOCK_ESCI_E:
		case PERIPHERAL_CLOCK_ESCI_F:
		case PERIPHERAL_CLOCK_IIC_A:
		case PERIPHERAL_CLOCK_IIC_B:
			prescaler = SIU.SYSCLK.B.LPCLKDIV0;
			break;
		case PERIPHERAL_CLOCK_ADC_A:
			prescaler = SIU.SYSCLK.B.LPCLKDIV2;
			break;
		case PERIPHERAL_CLOCK_EMIOS:
			prescaler = SIU.SYSCLK.B.LPCLKDIV3;
			break;
		default:
			assert(0);
			break;
	}

	return sysClock/(1<<prescaler);

}

#elif defined (CFG_MPC5604P)

 /**
  * Get the peripheral clock in Hz for a specific device
  */
 uint32_t McuE_GetPeripheralClock(McuE_PeriperalClock_t type)
 {
 	uint32_t sysClock = McuE_GetSystemClock();
	vuint32_t prescaler;

   // See table 3.1, section 3.4.5 Peripheral Clock dividers
	switch (type)
	{
		//case PERIPHERAL_CLOCK_ADC_0:
		//case PERIPHERAL_CLOCK_ADC_1:
		//case PERIPHERAL_CLOCK_ETIMER_0:
		//case PERIPHERAL_CLOCK_ETIMER_1:
	    case PERIPHERAL_CLOCK_FLEXPWM_0:
			/* FMPLL1 */
			 uint32_t eprediv = CGM.FMPLL[1].CR.B.IDF;
			 uint32_t emfd = CGM.FMPLL[1].CR.B.NDIV;
			 uint32_t erfd = CGM.FMPLL[1].CR.B.ODF;

