openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Mcu.c
			 uint32_t f_sys;
			 uint32  extal = Mcu_Global.config->McuClockSettingConfig[Mcu_Global.clockSetting].McuClockReferencePointFrequency;
			 f_sys = CALC_SYSTEM_CLOCK(extal,emfd,eprediv,erfd);

			 prescaler = CGM.AC0DC.B.DIV0;
			 return f_sys/(1<<prescaler);
	     break;

        case PERIPHERAL_CLOCK_FLEXCAN_A:
		case PERIPHERAL_CLOCK_FLEXCAN_B:
		case PERIPHERAL_CLOCK_FLEXCAN_C:
		case PERIPHERAL_CLOCK_FLEXCAN_D:
		case PERIPHERAL_CLOCK_FLEXCAN_E:
		case PERIPHERAL_CLOCK_FLEXCAN_F:
		case PERIPHERAL_CLOCK_DSPI_A:
 		case PERIPHERAL_CLOCK_DSPI_B:
		case PERIPHERAL_CLOCK_DSPI_C:
		case PERIPHERAL_CLOCK_DSPI_D:
		case PERIPHERAL_CLOCK_DSPI_E:
		case PERIPHERAL_CLOCK_DSPI_F:
		case PERIPHERAL_CLOCK_PIT:
		case PERIPHERAL_CLOCK_LIN_A:
		case PERIPHERAL_CLOCK_LIN_B:
 		case PERIPHERAL_CLOCK_LIN_C:
		case PERIPHERAL_CLOCK_LIN_D:
			prescaler = 0;
			break;

		default:
			assert(0);
			break;
	}

	return sysClock/(1<<prescaler);
}
#else

/**
 * Get the peripheral clock in Hz for a specific device
 */
uint32_t McuE_GetPeripheralClock(McuE_PeriperalClock_t type)
{
#if defined(CFG_MPC5567)
	// No peripheral dividers on 5567.
	return McuE_GetSystemClock();
#else
	uint32_t sysClock = McuE_GetSystemClock();
	vuint32_t prescaler;

  // See table 3.1, section 3.4.5 Peripheral Clock dividers
	switch (type)
	{
		case PERIPHERAL_CLOCK_FLEXCAN_A:
		case PERIPHERAL_CLOCK_DSPI_A:
#if defined(CFG_MPC5516)
			prescaler = SIU.SYSCLK.B.LPCLKDIV0;
			break;
#elif defined(CFG_MPC560X)
			prescaler = CGM.SC_DC[1].B.DIV;
			break;
#endif

		case PERIPHERAL_CLOCK_PIT:
		case PERIPHERAL_CLOCK_ESCI_A:
		case PERIPHERAL_CLOCK_IIC_A:
#if defined(CFG_MPC5516)
			prescaler = SIU.SYSCLK.B.LPCLKDIV1;
			break;
#endif

		case PERIPHERAL_CLOCK_FLEXCAN_B:
		case PERIPHERAL_CLOCK_FLEXCAN_C:
		case PERIPHERAL_CLOCK_FLEXCAN_D:
		case PERIPHERAL_CLOCK_FLEXCAN_E:
		case PERIPHERAL_CLOCK_FLEXCAN_F:
#if defined(CFG_MPC5516)
			prescaler = SIU.SYSCLK.B.LPCLKDIV2;
			break;
#elif defined(CFG_MPC560X)
			prescaler = CGM.SC_DC[1].B.DIV;
			break;
#endif

		case PERIPHERAL_CLOCK_DSPI_B:
		case PERIPHERAL_CLOCK_DSPI_C:
		case PERIPHERAL_CLOCK_DSPI_D:
		case PERIPHERAL_CLOCK_DSPI_E:
		case PERIPHERAL_CLOCK_DSPI_F:
#if defined(CFG_MPC5516)
		prescaler = SIU.SYSCLK.B.LPCLKDIV3;
			break;
#endif

		case PERIPHERAL_CLOCK_ESCI_B:
		case PERIPHERAL_CLOCK_ESCI_C:
		case PERIPHERAL_CLOCK_ESCI_D:
		case PERIPHERAL_CLOCK_ESCI_E:
		case PERIPHERAL_CLOCK_ESCI_F:
		case PERIPHERAL_CLOCK_ESCI_G:
		case PERIPHERAL_CLOCK_ESCI_H:
#if defined(CFG_MPC5516)
			prescaler = SIU.SYSCLK.B.LPCLKDIV4;
			break;
#endif

#if defined(CFG_MPC560X)
		case PERIPHERAL_CLOCK_LIN_A:
		case PERIPHERAL_CLOCK_LIN_B:
#if defined(CFG_MPC560XB) || defined(CFG_MPC5604P)
		case PERIPHERAL_CLOCK_LIN_C:
		case PERIPHERAL_CLOCK_LIN_D:
#endif
			prescaler = CGM.SC_DC[0].B.DIV;
			break;
		case PERIPHERAL_CLOCK_EMIOS_0:
			prescaler = CGM.SC_DC[2].B.DIV;
			break;
		case PERIPHERAL_CLOCK_EMIOS_1:
			prescaler = CGM.SC_DC[2].B.DIV;
			break;
#else
		case PERIPHERAL_CLOCK_EMIOS:
#if defined(CFG_MPC5516)
			prescaler = SIU.SYSCLK.B.LPCLKDIV5;
			break;
#endif
#endif

		case PERIPHERAL_CLOCK_MLB:
#if defined(CFG_MPC5516)
			prescaler = SIU.SYSCLK.B.LPCLKDIV6;
			break;
#endif

		default:
			assert(0);
			break;
	}

	return sysClock/(1<<prescaler);
#endif
}
#endif

/**
 * Get frequency of the oscillator
 */
uint32_t McuE_GetClockReferencePointFrequency(void)
{
	return Mcu_Global.config->McuClockSettingConfig[Mcu_Global.clockSetting].McuClockReferencePointFrequency;
}

/**
 * Function to setup the internal flash for optimal performance
 */

static void Mcu_ConfigureFlash(void)
{
	/* These flash settings increases the CPU performance of 7 times compared
   	   to reset default settings!! */

#if defined(CFG_MPC5516)
	/* Disable pipelined reads when flash options are changed. */
	FLASH.MCR.B.PRD = 1;

	/* Enable master prefetch for e200z1 and eDMA. */
	FLASH.PFCRP0.B.M0PFE = 1;
	FLASH.PFCRP0.B.M2PFE = 1;

	/* Address pipelining control. Must be set to the same value as RWSC. */
	FLASH.PFCRP0.B.APC = 2;
	FLASH.PFCRP0.B.RWSC = 2;

	/* Write wait states. */
	FLASH.PFCRP0.B.WWSC = 1;

	/* Enable data prefetch. */
	FLASH.PFCRP0.B.DPFEN = 1;

	/* Enable instruction prefetch. */
	FLASH.PFCRP0.B.IPFEN = 1;

	/* Prefetch algorithm. */
	/* TODO: Ask Freescale about this option. */
	FLASH.PFCRP0.B.PFLIM = 2;

	/* Enable line read buffers. */
	FLASH.PFCRP0.B.BFEN = 1;

	/* Enable pipelined reads again. */
	FLASH.MCR.B.PRD = 0;
#elif defined(CFG_MPC5668)
	/* Check values from cookbook and MPC5668x Microcontroller Data Sheet */

	/* Should probably trim this values */
	const typeof(FLASH.PFCRP0.B) val = {.M0PFE = 1, .M2PFE=1, .APC=3,
								 .RWSC=3, .WWSC =1, .DPFEN =1, .IPFEN = 1, .PFLIM =2,
								 .BFEN  = 1 };
	FLASH.PFCRP0.B = val;

	/* Enable pipelined reads again. */
#elif defined(CFG_MPC5554) || defined(CFG_MPC5567)
	//TODO: Lägg till flash för mpc5554 &67
#endif
}

uint32 EccErrReg = 0;

void McuE_GetECCError( uint32 *err ) {

	/* Clear interrupt flag */
#if defined(CFG_MPC5668)
	if(ECSM.ESR.B.PFNCE){
		ECSM.ESR.B.PFNCE = 1;
	}
	*err = EccErrReg;
#else
	*err = 0;
#endif

	/* Clear stored  */
	EccErrReg = 0;
}
